AccumulationRegisters/РасчетыСПоставщиками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСПоставщиками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплачивается</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОплате</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПоступлению</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакупкаПоЗаказу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежа</Name>
					<Comment>Заполняется для поступления товаров и услуг</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗалогЗаТару</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСПоставщиком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОперации</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗачетаПоДатеПлатежа</Name>
					<Comment>Используется в распределении расчетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РасчетныйДокументСПоставщиком</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыКонтроляОплатыПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетовПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерамПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПриемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПриемник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоДаннымОбъектаРасчетовИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОперацииВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЧислительВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЗнаменательВалютыВзаиморасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЧислительВалютыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсЗнаменательВалютыУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КурсВалюты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗаданияНеоперативногоДопроведенияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаданияНеоперативногоДопроведенияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОшибки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПериодЗадания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗадания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНеоперативныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КлючиАналитикиУчетаПоПартнерам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>КлючиАналитикиУчетаПоПартнерам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыМеждуОрганизациями</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

AccumulationRegisters/РасчетыСПоставщиками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК Т
	|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Т1 
	|	ПО Т.АналитикаУчетаПоПартнерам = Т1.КлючАналитики
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Т1.Организация)
	|	И ЗначениеРазрешено(Т1.Партнер)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// При определении доступных видов оповещений пользователей.
// 
// Параметры:
//  ОписаниеВидовОповещений - см. ОповещенияПользователейОСобытиях.ОписаниеВидовОповещенийПользователей
Процедура ПриОпределенииДоступныхВидовОповещенийПользователей(ОписаниеВидовОповещений) Экспорт
	
	ГруппаВидаОповещенийВзаиморасчеты = ОповещенияПользователейОСобытиях.ГруппаВидаОповещений("ВзаиморасчетыСПоставщиками");
	
	НовыйВидОповещений = ОповещенияПользователейОСобытиях.ДобавитьОписаниеВидаОповещенийПользователей(ОписаниеВидовОповещений);
	НовыйВидОповещений.ГруппаВидаОповещений = ГруппаВидаОповещенийВзаиморасчеты;
	НовыйВидОповещений.Идентификатор = "bd8bbddb-fdc1-4629-b533-f3c6ceeca4f8";
	НовыйВидОповещений.Наименование = НСтр("ru = 'Оформление оплаты поставщику'", ОбщегоНазначения.КодОсновногоЯзыка());
	НовыйВидОповещений.ТипОповещения = Перечисления.ТипыОповещенийПользователей.Оперативное;
	НовыйВидОповещений.ИмяШаблонаСКД = Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Макеты.Оповещения_ПоступлениеОплаты.ПолноеИмя();
	НовыйВидОповещений.ШаблонТекстаОповещения = "ru = 'Оформлена оплата поставщику на сумму [СуммаПлатежа] [Валюта] [ДатаПлатежа]. [ДокументОплаты]'"; // @NStr-1
	ОповещенияПользователейОСобытиях.ДобавитьОписаниеИсточникаДанных(НовыйВидОповещений,
		Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	
КонецПроцедуры

#КонецОбласти

#Область НеоперативнаяОчередьЗаданий

// Данные к формированию заданий неоперативного допроведения документов и распределению взаиморасчетов.
// Вызывается при записи набора записей регистра.
// 
// Параметры:
//  НаборЗаписей - РегистрНакопленияНаборЗаписей, РегистрСведенийНаборЗаписей - Записываемый набор записей регистра - источника.
//  ВидыЗаданий - Массив Из СправочникСсылка.ВидыНеоперативныхЗаданий - Список видов заданий.
//                По данному списку должны зарегистрироваться новые задания согласно записываемым данным регистра.
//  МенеджерВременныхТаблиц - Неопределено, МенеджерВременныхТаблиц - При указании МВТ данные временных таблиц будут использованы при формировании новых заданий.
//  ДанныеКРегистрацииЗаданий - Неопределено, ТаблицаЗначений - Таблица с данными к регистрации новых заданий.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Данные к формированию заданий неоперативного допроведения документов:
// * Организация - СправочникСсылка.Организации - Организация, по которой будет сформировано новое задание.
// * ПериодЗадания  - Дата - Период задания. Совпадает с периодом записываемых данных в регистре.
// * Документ - ДокументСсылка - Ссылка на документ, по которому будет зарегистрировано задание.
// * ВидЗадания - СправочникСсылка.ВидыНеоперативныхЗаданий - Вид регистрируемого задания.
//
Функция ДанныеКФормированиюЗаданийНеоперативногоДопроведенияДокументов(НаборЗаписей, ВидыЗаданий,
	МенеджерВременныхТаблиц = Неопределено, ДанныеКРегистрацииЗаданий = Неопределено) Экспорт
	
	ТаблицаДанных = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.ТаблицаФормированияЗаданий();
	
	Если Не МенеджерВременныхТаблиц = Неопределено Тогда

		Для Каждого ТекущийВидЗадания Из ВидыЗаданий Цикл

			Если ТекущийВидЗадания = Справочники.ВидыНеоперативныхЗаданий.ОтражениеДвиженийПоУправленческомуБалансу Тогда
				
				ТаблицаДанных = РегистрыСведений.ЗаданияНеоперативногоДопроведенияДокументов.ТаблицаФормированияЗаданий();
				
				Если ПланыОбмена.ГлавныйУзел() = Неопределено
					И Не МенеджерВременныхТаблиц = Неопределено 
					И МенеджерВременныхТаблиц.Таблицы.Найти("ОчередьДанныеКДопроведениюДокументовУпрБаланс") <> Неопределено Тогда
					ТаблицаДанных = МенеджерВременныхТаблиц.Таблицы["ОчередьДанныеКДопроведениюДокументовУпрБаланс"].ПолучитьДанные().Выгрузить();
				КонецЕсли;
				
				Возврат ТаблицаДанных;
				
			КонецЕсли;

			Если ТекущийВидЗадания = Справочники.ВидыНеоперативныхЗаданий.РаспределениеВзаиморасчетовПоСрокам Тогда
				ТаблицаДанных = РегистрыСведений.ЗаданияКРаспределениюВзаиморасчетов.ТаблицаФормированияЗаданий();
				Если МенеджерВременныхТаблиц.Таблицы.Найти("ЗаданияКРаспределениюВзаиморасчетовПоставщики") <> Неопределено Тогда
					ИсходныеДанные = МенеджерВременныхТаблиц.Таблицы["ЗаданияКРаспределениюВзаиморасчетовПоставщики"].ПолучитьДанные().Выгрузить();

					Для Каждого Запись Из ИсходныеДанные Цикл
						НоваяСтрока = ТаблицаДанных.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Запись);
						НоваяСтрока.ДатаЗаписи = ТекущаяДатаСеанса();
						НоваяСтрока.ПериодКонтроляИзменений = Запись.ПериодКонтроляИзмененийИСозданияЗаданий;
					КонецЦикла;
				КонецЕсли;
				
				Возврат ТаблицаДанных;
			КонецЕсли;
		КонецЦикла;

	КонецЕсли;

	Возврат ТаблицаДанных;
	
КонецФункции

// Формирует текст запроса получения данных для регистрации заданий в регистре очереди "Задания к распределению взаиморасчетов".
// Задания в регистре очереди будут формироваться по данным таблицы изменений движений, а также по движениям документов данного регистра расчетов, 
// расположенных в цепочке после изменяемых по тем же гранулам распределения взаиморасчетов (АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта).
// 
// Возвращаемое значение:
//  Строка - Текст запроса
Функция ТекстЗапросаДанныеКРегистрацииЗаданийРаспределенияВзаиморасчетов() Экспорт
	
	ТекстЗапроса = "
	|ВЫБРАТЬ
	|	МИНИМУМ(НАЧАЛОПЕРИОДА(ВЫБОР КОГДА РасчетыСПоставщикамиИзменения.Сумма = 0
	|								И (РасчетыСПоставщикамиИзменения.КОплате <> 0 ИЛИ РасчетыСПоставщикамиИзменения.КПоступлению <> 0)
	|								И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Документ) <> ТИП(Документ.ВводОстатков)
	|								И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|							ТОГДА РасчетыСПоставщикамиИзменения.ДатаРегистратора
	|							ИНАЧЕ РасчетыСПоставщикамиИзменения.Период
	|						КОНЕЦ, ДЕНЬ)) КАК Период,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА &НеПроверятьДатуЗапретаИНеСоздаватьДочерниеЗадания
	|				ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиИзменения.Период, ДЕНЬ)
	|		КОНЕЦ) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РасчетыСПоставщикамиИзменения.Валюта КАК Валюта
	|ПОМЕСТИТЬ МинимальныеПериодыИзмененийПоставщики
	|ИЗ
	|	РасчетыСПоставщикамиИзменения КАК РасчетыСПоставщикамиИзменения
	|ГДЕ
	|	(РасчетыСПоставщикамиИзменения.Сумма <> 0
	|	ИЛИ РасчетыСПоставщикамиИзменения.КОплате <> 0
	|	ИЛИ РасчетыСПоставщикамиИзменения.КПоступлению <> 0
	|	ИЛИ РасчетыСПоставщикамиИзменения.СуммаРегл <> 0
	|	ИЛИ РасчетыСПоставщикамиИзменения.СуммаУпр <> 0)
	|	И &НовыеРасчеты
	|	И &СоздаватьЗаданияКРаспределениюВзаиморасчетов
	|СГРУППИРОВАТЬ ПО
	|	РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам,
	|	РасчетыСПоставщикамиИзменения.ОбъектРасчетов,
	|	РасчетыСПоставщикамиИзменения.Валюта
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ОбъектРасчетов,
	|	Валюта;
	|ВЫБРАТЬ
	|	МИНИМУМ(ЗаданияКРаспределению.ПериодЗадания) КАК ПериодЗадания,
	|	МИНИМУМ(ЗаданияКРаспределению.ПериодКонтроляИзмененийИСозданияЗаданий) КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|	ЗаданияКРаспределению.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЗаданияКРаспределению.ОбъектРасчетов КАК ОбъектРасчетов,
	|	ЗаданияКРаспределению.Валюта КАК Валюта,
	|	ЗаданияКРаспределению.Документ КАК Документ,
	|	ЗаданияКРаспределению.Организация КАК Организация
	|ПОМЕСТИТЬ ЗаданияКРаспределениюВзаиморасчетовПоставщики
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР КОГДА РасчетыСПоставщиками.Сумма = 0
	|				И (РасчетыСПоставщиками.КОплате <> 0 ИЛИ РасчетыСПоставщиками.КПоступлению <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСПоставщиками.ДатаРегистратора
	|			ИНАЧЕ РасчетыСПоставщиками.Период
	|		КОНЕЦ КАК ПериодЗадания,
	|		МинимальныеПериодыИзмененийПоставщики.ПериодКонтроляИзмененийИСозданияЗаданий КАК ПериодКонтроляИзмененийИСозданияЗаданий,
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
	|		РасчетыСПоставщиками.Валюта КАК Валюта,
	|		РасчетыСПоставщиками.Регистратор КАК Документ,
	|		РасчетыСПоставщиками.АналитикаУчетаПоПартнерам.Организация КАК Организация
	|	ИЗ
	|		РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ МинимальныеПериодыИзмененийПоставщики КАК МинимальныеПериодыИзмененийПоставщики
	|			ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = МинимальныеПериодыИзмененийПоставщики.АналитикаУчетаПоПартнерам
	|			И РасчетыСПоставщиками.ОбъектРасчетов = МинимальныеПериодыИзмененийПоставщики.ОбъектРасчетов
	|			И РасчетыСПоставщиками.Валюта = МинимальныеПериодыИзмененийПоставщики.Валюта
	|			И ВЫБОР КОГДА РасчетыСПоставщиками.Сумма = 0
	|				И (РасчетыСПоставщиками.КОплате <> 0 ИЛИ РасчетыСПоставщиками.КПоступлению <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСПоставщиками.ДатаРегистратора
	|			ИНАЧЕ РасчетыСПоставщиками.Период
	|			КОНЕЦ >= МинимальныеПериодыИзмененийПоставщики.Период
	|	ГДЕ
	|		РасчетыСПоставщиками.Активность
	|		И (РасчетыСПоставщиками.Сумма <> 0
	|		ИЛИ РасчетыСПоставщиками.КОплате <> 0
	|		ИЛИ РасчетыСПоставщиками.КПоступлению <> 0
	|		ИЛИ РасчетыСПоставщиками.СуммаРегл <> 0
	|		ИЛИ РасчетыСПоставщиками.СуммаУпр <> 0)
	|		И &НовыеРасчеты
	|		И &СоздаватьЗаданияКРаспределениюВзаиморасчетов
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ВЫБОР КОГДА РасчетыСПоставщикамиИзменения.Сумма = 0
	|				И (РасчетыСПоставщикамиИзменения.КОплате <> 0 ИЛИ РасчетыСПоставщикамиИзменения.КПоступлению <> 0)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Документ) <> ТИП(Документ.ВводОстатков)
	|				И ТИПЗНАЧЕНИЯ(РасчетыСПоставщикамиИзменения.Документ) <> ТИП(Документ.ВводОстатковВзаиморасчетов)
	|			ТОГДА РасчетыСПоставщикамиИзменения.ДатаРегистратора
	|			ИНАЧЕ РасчетыСПоставщикамиИзменения.Период
	|		КОНЕЦ,
	|		ВЫБОР
	|			КОГДА &НеПроверятьДатуЗапретаИНеСоздаватьДочерниеЗадания
	|				ТОГДА ДАТАВРЕМЯ(3999, 1, 1)
	|			ИНАЧЕ НАЧАЛОПЕРИОДА(РасчетыСПоставщикамиИзменения.Период, ДЕНЬ)
	|		КОНЕЦ,
	|		РасчетыСПоставщикамиИзменения.АналитикаУчетаПоПартнерам,
	|		РасчетыСПоставщикамиИзменения.ОбъектРасчетов,
	|		РасчетыСПоставщикамиИзменения.Валюта,
	|		РасчетыСПоставщикамиИзменения.Документ,
	|		РасчетыСПоставщикамиИзменения.Организация
	|	ИЗ
	|		РасчетыСПоставщикамиИзменения КАК РасчетыСПоставщикамиИзменения
	|	ГДЕ
	|		(РасчетыСПоставщикамиИзменения.Сумма <> 0
	|		ИЛИ РасчетыСПоставщикамиИзменения.КОплате <> 0
	|		ИЛИ РасчетыСПоставщикамиИзменения.КПоступлению <> 0
	|		ИЛИ РасчетыСПоставщикамиИзменения.СуммаРегл <> 0
	|		ИЛИ РасчетыСПоставщикамиИзменения.СуммаУпр <> 0)
	|		И &НовыеРасчеты
	|		И &СоздаватьЗаданияКРаспределениюВзаиморасчетов) КАК ЗаданияКРаспределению
	|СГРУППИРОВАТЬ ПО
	|	ЗаданияКРаспределению.АналитикаУчетаПоПартнерам,
	|	ЗаданияКРаспределению.ОбъектРасчетов,
	|	ЗаданияКРаспределению.Валюта,
	|	ЗаданияКРаспределению.Документ,
	|	ЗаданияКРаспределению.Организация";
		
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для построения плана обновления.
//
// Параметры:
// 	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыНакопления.РасчетыСПоставщиками.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "11.5.27.21";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("a2f265d9-44a0-4a59-a251-a9dcd21023bc");
	Обработчик.Многопоточный = Истина;
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыНакопления.РасчетыСПоставщиками.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Критичный;
	Обработчик.Комментарий = СтрШаблон(НСтр("ru = 'Исправляет реквизит ""%1"" для движений расчетов.
	                                              |Исправляет дату регистратора ""Бронирование"".
	                                              |Исправляет реквизит ""%2"" для движений платежей без даты погашения.
	                                              |Заполняет реквизиты курсов валют взаиморасчетов и упр. учета.'"),
		Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Реквизиты.ПорядокОперации.Представление(),
		Метаданные.РегистрыНакопления.РасчетыСПоставщиками.Реквизиты.ПорядокЗачетаПоДатеПлатежа.Представление());
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Обработчик.БлокируемыеОбъекты = "";

КонецПроцедуры

// Процедура регистрации данных для обработчика обновления ОбработатьДанныеДляПереходаНаВерсию.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяРегистра = "РегистрНакопления.РасчетыСПоставщиками";
	
	МассивТипов = Новый Массив;
	Для Каждого ТипРегистратора Из Метаданные.РегистрыНакопления.РасчетыСПоставщиками.СтандартныеРеквизиты.Регистратор.Тип.Типы() Цикл
		МассивТипов.Добавить(Метаданные.НайтиПоТипу(ТипРегистратора).ПолноеИмя());
	КонецЦикла;
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = СтрСоединить(МассивТипов, ",");
	ПараметрыВыборки.ПолныеИменаРегистров = ПолноеИмяРегистра;
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Период УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Период УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиРегистраторыРегистра();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	#Область ТекстЗапроса
	Запрос.Текст = "
	|// Исправить дату регистратора документов ""Бронирование""
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВтКОбработке
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ОперацияСЭлектроннымБилетом КАК ОперацияСЭлектроннымБилетом
	|		ПО Расчеты.Регистратор = ОперацияСЭлектроннымБилетом.Ссылка
	|ГДЕ
	|	НЕ Расчеты.Период = Расчеты.ДатаРегистратора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииПлатежейБезДатыПогашения
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.ДатаПлатежа = ДАТАВРЕМЯ(1,1,1)
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.Сумма > 0
	|	И ВЫРАЗИТЬ(ЛЕВ(Расчеты.ПорядокЗачетаПоДатеПлатежа, 4) КАК Строка(4))<> ""3000""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииВводаОстатковАвансов
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	(Расчеты.Регистратор ССЫЛКА Документ.ВводОстатковВзаиморасчетов
	|		ИЛИ Расчеты.Регистратор ССЫЛКА Документ.ВводОстатков)
	|	И Расчеты.Период <> Расчеты.ДатаРегистратора
	|	И Расчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|	И Расчеты.ДатаРегистратора >= ДАТАВРЕМЯ(2010,1,1)
	|	И (СТРОКА(ГОД(Расчеты.Период) - 2000) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 3, 2)
	|		ИЛИ ВЫБОР КОГДА МЕСЯЦ(Расчеты.Период) > 9
	|				ТОГДА СТРОКА(МЕСЯЦ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 5, 2)
	|				ИНАЧЕ СТРОКА(МЕСЯЦ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 6, 1)
	|					ИЛИ ПОДСТРОКА(Расчеты.ПорядокОперации, 5, 1) <> ""0""
	|			КОНЕЦ
	|		ИЛИ ВЫБОР КОГДА ДЕНЬ(Расчеты.Период) > 9
	|				ТОГДА СТРОКА(ДЕНЬ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 7, 2)
	|				ИНАЧЕ СТРОКА(ДЕНЬ(Расчеты.Период)) <> ПОДСТРОКА(Расчеты.ПорядокОперации, 8, 1)
	|					ИЛИ ПОДСТРОКА(Расчеты.ПорядокОперации, 7, 1) <> ""0""
	|			КОНЕЦ)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 9, 1) = ""1""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, 9, 1) = ""9""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|ГДЕ
	|	РасчетыСПоставщиками.Сумма <> 0
	|	И РасчетыСПоставщиками.СуммаРегл <> 0
	|	И РасчетыСПоставщиками.Валюта <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСПоставщиками.ВалютаДокумента <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСПоставщиками.КурсЧислительВалютыВзаиморасчетов = 0
	|	И РасчетыСПоставщиками.КурсЗнаменательВалютыВзаиморасчетов = 0
	|	И НЕ РасчетыСПоставщиками.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
	|		ПО РасчетыСПоставщиками.Валюта <> ВалютаУправленческогоУчета.Значение
	|			И РасчетыСПоставщиками.ВалютаДокумента <> ВалютаУправленческогоУчета.Значение
	|ГДЕ
	|	РасчетыСПоставщиками.Сумма <> 0
	|	И РасчетыСПоставщиками.СуммаУпр <> 0
	|	И РасчетыСПоставщиками.КурсЧислительВалютыУпр = 0
	|	И РасчетыСПоставщиками.КурсЗнаменательВалютыУпр = 0
	|	И НЕ РасчетыСПоставщиками.ХозяйственнаяОперация В (&ОперацииСРучнымКурсом)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
	|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков), ТИП(Документ.ВводОстатковВзаиморасчетов))
	|	И РасчетыСПоставщиками.Сумма <> 0
	|	И РасчетыСПоставщиками.СуммаРегл <> 0
	|	И РасчетыСПоставщиками.Валюта <> Организации.ВалютаРегламентированногоУчета
	|	И РасчетыСПоставщиками.КурсЧислительВалютыВзаиморасчетов = 0
	|	И РасчетыСПоставщиками.КурсЗнаменательВалютыВзаиморасчетов = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасчетыСПоставщиками.Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.ВалютаУправленческогоУчета КАК ВалютаУправленческогоУчета
	|		ПО РасчетыСПоставщиками.Валюта <> ВалютаУправленческогоУчета.Значение
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РасчетыСПоставщиками.Регистратор) В (ТИП(Документ.ВводОстатков), ТИП(Документ.ВводОстатковВзаиморасчетов))
	|	И РасчетыСПоставщиками.Сумма <> 0
	|	И РасчетыСПоставщиками.СуммаУпр <> 0
	|	И РасчетыСПоставщиками.КурсЧислительВалютыУпр = 0
	|	И РасчетыСПоставщиками.КурсЗнаменательВалютыУпр = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ОчисткаПриемниковИсточниковУСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|ГДЕ
	|	Расчеты.Сторно
	|	И Расчеты.КорАналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// ИсправлениеПорядковОперацииПереносаРасчетов
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ПОМЕСТИТЬ ВтКПолучениюНомеров
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	НЕ Расчеты.Сторно
	|	И Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииСторно
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.Сторно
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииОтгрузка
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.ОперацияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ИсправлениеПорядковОперацииПереносЗадолженностиПоЦД
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор,
	|	Реестр.НомерДокументаИБ КАК НомерДокумента
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК Реестр
	|		ПО Расчеты.Регистратор = Реестр.Ссылка
	|			И НЕ Реестр.ДополнительнаяЗапись
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВтКОбработке КАК ВтКОбработке
	|		ПО Расчеты.Регистратор = ВтКОбработке.Регистратор
	|			И ВтКОбработке.Регистратор ЕСТЬ NULL
	|ГДЕ
	|	Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	|	И НЕ ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВозвратТоваровПоставщику),
	|	                                         ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	
	|	                                         ТИП(Документ.ОперацияСЭлектроннымБилетом))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКПолучениюНомеров.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА) КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомераЗаполненныеПоРеестру
	|ИЗ
	|	ВтКПолучениюНомеров КАК ВтКПолучениюНомеров
	|ГДЕ
	|	ДЛИНАСТРОКИ(ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА)) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВтКПолучениюНомеров.Регистратор КАК Регистратор
	|ИЗ
	|	ВтКПолучениюНомеров КАК ВтКПолучениюНомеров
	|ГДЕ
	|	ДЛИНАСТРОКИ(ВЫРАЗИТЬ(ЕСТЬNULL(ВтКПолучениюНомеров.НомерДокумента, """") КАК СТРОКА) ) = 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВтКПолучениюНомеров
	|";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("ОперацииСРучнымКурсом", ОперативныеВзаиморасчетыСервер.ХозяйственныеОперацииСРучнымКурсом());
	РегистраторыСПустымиНомерами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	РегистраторыСНомерами = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
		РегистраторыСПустымиНомерами,
		Метаданные.Документы.ПриобретениеТоваровУслуг.СтандартныеРеквизиты.Номер.Имя); 
	ТзРегистраторыСНомерами = Новый ТаблицаЗначений;
	ТзРегистраторыСНомерами.Колонки.Добавить("Регистратор",
		Новый ОписаниеТипов(Метаданные.РегистрыНакопления.РасчетыСПоставщиками.СтандартныеРеквизиты.Регистратор.Тип.Типы()));
	ТзРегистраторыСНомерами.Колонки.Добавить("НомерДокумента", Новый ОписаниеТипов("Строка"));
	Для Каждого КлючИЗначение Из РегистраторыСНомерами Цикл
		Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = ТзРегистраторыСНомерами.Добавить();
		НоваяСтрока.Регистратор = КлючИЗначение.Ключ;
		НоваяСтрока.НомерДокумента = КлючИЗначение.Значение;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТзРегистраторыСНомерами", ТзРегистраторыСНомерами);
	#Область ТекстЗапроса
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	ВЫРАЗИТЬ(Таблица.НомерДокумента КАК СТРОКА) КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомераЗаполненныеВнеЗапроса
	|ИЗ
	|	&ТзРегистраторыСНомерами КАК Таблица
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерДокумента КАК НомерДокумента
	|ПОМЕСТИТЬ ВтНомера
	|ИЗ
	|	ВтНомераЗаполненныеВнеЗапроса КАК Таблица
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Таблица.Регистратор КАК Регистратор,
	|	Таблица.НомерДокумента КАК НомерДокумента
	|ИЗ
	|	ВтНомераЗаполненныеПоРеестру КАК Таблица
	|
	|ИНДЕКСИРОВАТЬ ПО 
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// Документы к обработке, найденные до получения номеров
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВтКОбработке.Регистратор КАК Регистратор
	|ИЗ
	|	ВтКОбработке КАК ВтКОбработке
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Сторно с заполненным порядком операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> """"
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Документы с лишними символами в порядке операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) > 1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Источники без порядка операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.АналитикаУчетаПоПартнерамПриемник <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Приемники без порядка операции внутри документа
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.КорАналитикаУчетаПоПартнерам <> ЗНАЧЕНИЕ(Справочник.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ДЛИНАСТРОКИ(ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 2)) = 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// Отгрузка с порядком операции внутри документа 1
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.ОперацияВзаиморасчетов = ЗНАЧЕНИЕ(Перечисление.ОперацииВзаиморасчетов.Отгрузка)
	|	И НЕ Расчеты.Сторно
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> ""4""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|// ПереносЗадолженностиМеждуФилиалами с порядком операции внутри документа 2
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Расчеты.Регистратор КАК Регистратор
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками КАК Расчеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВтНомера КАК ВтНомера
	|		ПО Расчеты.Регистратор = ВтНомера.Регистратор
	|ГДЕ
	|	Расчеты.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПереносЗадолженностиМеждуФилиалами)
	|	И НЕ Расчеты.Сторно
	|	И НЕ ТИПЗНАЧЕНИЯ(Расчеты.Регистратор) В (ТИП(Документ.ВозвратТоваровПоставщику),
	|	                                         ТИП(Документ.ВозвратТоваровМеждуОрганизациями),
	
	|	                                         ТИП(Документ.ОперацияСЭлектроннымБилетом))
	|	И СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) > 0
	|	И ПОДСТРОКА(Расчеты.ПорядокОперации, СТРНАЙТИ(Расчеты.ПорядокОперации, ВтНомера.НомерДокумента) + ДЛИНАСТРОКИ(ВтНомера.НомерДокумента), 1) <> ""5""
	|";
	#КонецОбласти
	
	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(
		Параметры, 
		Регистраторы,
		ПолноеИмяРегистра);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрНакопления.РасчетыСПоставщиками";

	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОбновляемыеДанные", ОбновляемыеДанные);
	Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ОбновляемыеДанные.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ ВтДляОбработки
		|ИЗ
		|	&ОбновляемыеДанные КАК ОбновляемыеДанные
		|ИНДЕКСИРОВАТЬ ПО
		|	Регистратор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СсылкиДляОбработки.Регистратор КАК Регистратор,
		|	РеестрДокументов.СторнируемыйДокумент КАК СторнируемыйДокумент
		|ПОМЕСТИТЬ ВтСторнируемыеДокументы
		|ИЗ
		|	ВтДляОбработки КАК СсылкиДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|			ПО СсылкиДляОбработки.Регистратор = РеестрДокументов.Ссылка
		|				И РеестрДокументов.СторноИсправление
		|				И НЕ РеестрДокументов.ДополнительнаяЗапись
		|ИНДЕКСИРОВАТЬ ПО
		|	СторнируемыйДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СторнируемыеДокументы.Регистратор КАК Регистратор,
		|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	РасчетыСПоставщиками.ОбъектРасчетов КАК ОбъектРасчетов,
		|	РасчетыСПоставщиками.Валюта КАК Валюта,
		|	РасчетыСПоставщиками.ВидДвижения КАК ВидДвижения,
		|	РасчетыСПоставщиками.Сумма КАК Сумма,
		|	РасчетыСПоставщиками.КОплате КАК КОплате,
		|	РасчетыСПоставщиками.КПоступлению КАК КПоступлению,
		|	ПОДСТРОКА(РасчетыСПоставщиками.ПорядокОперации, 9, 1) КАК ВидОперацииДляСортировки
		|ИЗ
		|	ВтСторнируемыеДокументы КАК СторнируемыеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
		|			ПО СторнируемыеДокументы.СторнируемыйДокумент = РасчетыСПоставщиками.Регистратор
		|ГДЕ
		|	НЕ РасчетыСПоставщиками.Сторно
		|	И (РасчетыСПоставщиками.Сумма <> 0
		|		ИЛИ РасчетыСПоставщиками.КОплате <> 0
		|		ИЛИ РасчетыСПоставщиками.КПоступлению <> 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СсылкиДляОбработки.Регистратор КАК Регистратор,
		|	РеестрДокументов.НомерДокументаИБ КАК НомерДокумента
		|ИЗ
		|	ВтДляОбработки КАК СсылкиДляОбработки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
		|			ПО СсылкиДляОбработки.Регистратор = РеестрДокументов.Ссылка
		|				И НЕ РеестрДокументов.ДополнительнаяЗапись
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	РасчетыСПоставщиками.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		|	Организации.ВалютаРегламентированногоУчета КАК ВалютаРегламентированногоУчета
		|ИЗ
		|	РегистрНакопления.РасчетыСПоставщиками КАК РасчетыСПоставщиками
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КлючиАналитикиУчетаПоПартнерам КАК КлючиАналитикиУчетаПоПартнерам
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
		|			ПО КлючиАналитикиУчетаПоПартнерам.Организация = Организации.Ссылка
		|		ПО РасчетыСПоставщиками.АналитикаУчетаПоПартнерам = КлючиАналитикиУчетаПоПартнерам.Ссылка
		|ГДЕ
		|	РасчетыСПоставщиками.Регистратор В(ВЫБРАТЬ Т.Регистратор ИЗ ВтДляОбработки КАК Т)
		|";
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеСторнируемыхДокументов = РезультатЗапроса[2].Выгрузить();
	ДанныеСторнируемыхДокументов.Индексы.Добавить("Регистратор");
	ДанныеСторнируемыхДокументов.Индексы.Добавить("Регистратор, АналитикаУчетаПоПартнерам, ОбъектРасчетов, Валюта, ВидДвижения, Сумма, КОплате, КПоступлению");
	
	НомераДокументов = РезультатЗапроса[3].Выгрузить();
	НомераДокументов.Индексы.Добавить("Регистратор");
	
	ВалютыРегл = РезультатЗапроса[4].Выгрузить();
	ВалютыРегл.Индексы.Добавить("АналитикаУчетаПоПартнерам");
	ВалютаУпр = ОбщегоНазначенияУТПовтИсп.ЗначениеКонстанты("ВалютаУправленческогоУчета");
	РазрядностьЦелойЧастиКурса = Метаданные.ОпределяемыеТипы.КурсВалюты.Тип.КвалификаторыЧисла.Разрядность
	                           - Метаданные.ОпределяемыеТипы.КурсВалюты.Тип.КвалификаторыЧисла.РазрядностьДробнойЧасти;
	ОграничениеЦелойЧасти = Pow(10, РазрядностьЦелойЧастиКурса - 1);
	
	Для Каждого СтрокаОбновляемыхДанных Из ОбновляемыеДанные Цикл
		
		ОбновляемыйРегистратор = СтрокаОбновляемыхДанных.Регистратор;
				
		НачатьТранзакцию();
		
		Попытка
			
			ПричинаИсключения = "Блокировка";
			#Область Блокировки
			Блокировка = Новый БлокировкаДанных;
			
			ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПоставщиками.НаборЗаписей");
			ЭлементБлокировки.УстановитьЗначение("Регистратор", ОбновляемыйРегистратор);
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			
			Блокировка.Заблокировать();
			#КонецОбласти
			
			ПричинаИсключения = "ПлохиеДанные";
			НаборЗаписей = СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(ОбновляемыйРегистратор);
			НаборЗаписей.Прочитать();
			
			#Область ОчисткаПриемниковИсточниковУСторно
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сторно 
					И (Запись.ПоДаннымОбъектаРасчетовИсточника
						Или ЗначениеЗаполнено(Запись.КорАналитикаУчетаПоПартнерам)
						Или ЗначениеЗаполнено(Запись.КорОбъектРасчетов)
						Или ЗначениеЗаполнено(Запись.АналитикаУчетаПоПартнерамПриемник)
						Или ЗначениеЗаполнено(Запись.ОбъектРасчетовПриемник)
						Или ЗначениеЗаполнено(Запись.ВалютаПриемник)
						Или Запись.СуммаПриемник <> 0) Тогда
						Запись.ПоДаннымОбъектаРасчетовИсточника  = Ложь;
						Запись.КорАналитикаУчетаПоПартнерам      = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						Запись.КорОбъектРасчетов                 = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						Запись.АналитикаУчетаПоПартнерамПриемник = Справочники.КлючиАналитикиУчетаПоПартнерам.ПустаяСсылка();
						Запись.ОбъектРасчетовПриемник            = Справочники.ОбъектыРасчетов.ПустаяСсылка();
						Запись.ВалютаПриемник                    = Справочники.Валюты.ПустаяСсылка();
						Запись.СуммаПриемник                     = 0;
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеДатыРегистратора
			Если ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ОперацияСЭлектроннымБилетом") Тогда
				Для Каждого Запись Из НаборЗаписей Цикл
					Если НЕ Запись.ДатаРегистратора = Запись.Период Тогда
						
						Запись.ДатаРегистратора = Запись.Период;
						ДатаСтрокой  = Формат(Запись.ДатаРегистратора, "ДФ=yyyyMMdd");
						НовыйПорядок = ДатаСтрокой + Сред(Запись.ПорядокОперации, 9);
						Запись.ПорядокОперации = НовыйПорядок;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииВнутриДокумента
			СтрокиНомерДокумента = НомераДокументов.НайтиСтроки(Новый Структура("Регистратор", ОбновляемыйРегистратор));
			Если СтрокиНомерДокумента.Количество() > 0
				И ЗначениеЗаполнено(СтрокиНомерДокумента[0].НомерДокумента) Тогда
				НомерДокумента = СтрокиНомерДокумента[0].НомерДокумента;
			Иначе
				НомерДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОбновляемыйРегистратор,
					Метаданные.Документы.ПриобретениеТоваровУслуг.СтандартныеРеквизиты.Номер.Имя);
			КонецЕсли;
			РегистрыНакопления.РасчетыСКлиентами.ИсправитьПорядокОперацииВПределахДокумента(НаборЗаписей, НомерДокумента);
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииПлатежейБезДатыПогашения
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.Сумма > 0 
					И Запись.ДатаПлатежа = Дата(1,1,1)
					И Лев(Запись.ПорядокЗачетаПоДатеПлатежа,4) <> "3000" Тогда
					Запись.ПорядокЗачетаПоДатеПлатежа = "30000101" + Прав(Запись.ПорядокЗачетаПоДатеПлатежа,СтрДлина(Запись.ПорядокЗачетаПоДатеПлатежа)-8);
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииВводаОстатковАвансов
			Для Каждого Запись Из НаборЗаписей Цикл
				Если (ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков"))
					И Запись.ДатаРегистратора <> Запись.Период
					И Запись.ВидДвижения = ВидДвиженияНакопления.Приход
					И Запись.ДатаРегистратора >= Дата(2010, 1, 1)
					И Лев(Запись.ПорядокОперации, 8) <> Формат(Запись.Период, "ДФ=yyyyMMdd") Тогда
					
					ДатаСтрокой = Формат(Запись.Период, "ДФ=yyyyMMdd");
					Запись.ПорядокОперации = ДатаСтрокой + Сред(Запись.ПорядокОперации, 9);
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ИсправлениеПорядковОперацииСторно
			ДвиженияСторнируемогоДокумента = ДанныеСторнируемыхДокументов.НайтиСтроки(Новый Структура("Регистратор", ОбновляемыйРегистратор));
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сторно
					И (Сред(Запись.ПорядокОперации, 9, 1) = "1"
						Или Сред(Запись.ПорядокОперации, 9, 1) = "9") Тогда
					
					// Проверим количество разных видов операций в движениях исправляемого документа
					ЕстьРазныеВидыОпераций = Ложь;
					ВидОперацииДляСортировки = "";
					Для Каждого СтрокаДвижений Из ДвиженияСторнируемогоДокумента Цикл
						Если ЗначениеЗаполнено(СтрокаДвижений.ВидОперацииДляСортировки) Тогда
							Если Не ЗначениеЗаполнено(ВидОперацииДляСортировки) Тогда
								ВидОперацииДляСортировки = СтрокаДвижений.ВидОперацииДляСортировки;
							ИначеЕсли СтрокаДвижений.ВидОперацииДляСортировки <> ВидОперацииДляСортировки Тогда
								ЕстьРазныеВидыОпераций = Истина;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
					// Если есть несколько разных видов операций, то нужно заполнить вид операции для сортировки
					// по ключевым полям и ресурсам исправляемого документа, иначе - берем единственный вид опереции.
					Если ЕстьРазныеВидыОпераций Тогда
						
						СтруктураОтбора = Новый Структура;
						СтруктураОтбора.Вставить("Регистратор",               ОбновляемыйРегистратор);
						СтруктураОтбора.Вставить("АналитикаУчетаПоПартнерам", Запись.АналитикаУчетаПоПартнерам);
						СтруктураОтбора.Вставить("ОбъектРасчетов",            Запись.ОбъектРасчетов);
						СтруктураОтбора.Вставить("Валюта",                    Запись.Валюта);
						СтруктураОтбора.Вставить("ВидДвижения",               Запись.ВидДвижения);
						СтруктураОтбора.Вставить("Сумма",                   - Запись.Сумма);
						СтруктураОтбора.Вставить("КОплате",                 - Запись.КОплате);
						СтруктураОтбора.Вставить("КПоступлению",            - Запись.КПоступлению);
						
						ВидыОперацийПоКлючевымПолям = ДанныеСторнируемыхДокументов.НайтиСтроки(СтруктураОтбора);
						
						ВидОперацииДляСортировки = "";
						Для Каждого СтрокаДвижений Из ВидыОперацийПоКлючевымПолям Цикл
							Если ЗначениеЗаполнено(СтрокаДвижений.ВидОперацииДляСортировки) Тогда
								ВидОперацииДляСортировки = СтрокаДвижений.ВидОперацииДляСортировки;
								Прервать;
							КонецЕсли;
						КонецЦикла;
						
						Запись.ПорядокОперации = Лев(Запись.ПорядокОперации, 8) 
							+ ?(ЗначениеЗаполнено(ВидОперацииДляСортировки), ВидОперацииДляСортировки, "2")
							+ Сред(Запись.ПорядокОперации, 10);
						
					Иначе
						
						Запись.ПорядокОперации = Лев(Запись.ПорядокОперации, 8) 
							+ ?(ЗначениеЗаполнено(ВидОперацииДляСортировки), ВидОперацииДляСортировки, "2")
							+ Сред(Запись.ПорядокОперации, 10);
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			#Область ЗаполнениеКурсов
			Для Каждого Запись Из НаборЗаписей Цикл
				Если Запись.Сумма <> 0
					И Запись.СуммаРегл <> 0
					И Запись.КурсЧислительВалютыВзаиморасчетов = 0
					И Запись.КурсЗнаменательВалютыВзаиморасчетов = 0 Тогда
					СтрокаВалютыРегл = ВалютыРегл.Найти(Запись.АналитикаУчетаПоПартнерам, "АналитикаУчетаПоПартнерам");
					Если СтрокаВалютыРегл <> Неопределено 
						И Запись.Валюта <> СтрокаВалютыРегл.ВалютаРегламентированногоУчета
						И (Запись.ВалютаДокумента <> СтрокаВалютыРегл.ВалютаРегламентированногоУчета
							Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
							Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")) Тогда
						КурсВалютыВзаиморасчетов = Запись.СуммаРегл / Запись.Сумма;
						ЧислительПриведенный = КурсВалютыВзаиморасчетов;
						ЗнаменательПриведенный = 1;
						Пока ЧислительПриведенный < ОграничениеЦелойЧасти
							И ЗнаменательПриведенный < ОграничениеЦелойЧасти Цикл
							ЧислительПриведенный = ЧислительПриведенный * 10;
							ЗнаменательПриведенный = ЗнаменательПриведенный * 10;
						КонецЦикла;
						Запись.КурсЧислительВалютыВзаиморасчетов = ЧислительПриведенный;
						Запись.КурсЗнаменательВалютыВзаиморасчетов = ЗнаменательПриведенный;
					КонецЕсли;
				КонецЕсли;
				Если Запись.СуммаРегл <> 0
					И Запись.СуммаУпр <> 0
					И Запись.КурсЧислительВалютыУпр = 0
					И Запись.КурсЗнаменательВалютыУпр = 0
					И Запись.Валюта <> ВалютаУпр
					И (Запись.ВалютаДокумента <> ВалютаУпр
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатков")
						Или ТипЗнч(ОбновляемыйРегистратор) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов")) Тогда
					КурсВалютыУпр = Запись.СуммаРегл / Запись.СуммаУпр;
					ЧислительПриведенный = КурсВалютыУпр;
					ЗнаменательПриведенный = 1;
					Пока ЧислительПриведенный < ОграничениеЦелойЧасти
						И ЗнаменательПриведенный < ОграничениеЦелойЧасти Цикл
						ЧислительПриведенный = ЧислительПриведенный * 10;
						ЗнаменательПриведенный = ЗнаменательПриведенный * 10;
					КонецЦикла;
					Запись.КурсЧислительВалютыУпр = ЧислительПриведенный;
					Запись.КурсЗнаменательВалютыУпр = ЗнаменательПриведенный;
				КонецЕсли;
			КонецЦикла;
			#КонецОбласти
			
			ИзменилисьИтоги = Ложь;
			Если НаборЗаписей.Количество() > 0 Тогда
				ИзменилисьИтоги = РегистрыНакопления.РасчетыСКлиентами.ЕстьИзмененияИтоговНабора(НаборЗаписей);
			КонецЕсли;
			
			Если НаборЗаписей.Модифицированность() И НЕ ИзменилисьИтоги Тогда
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(НаборЗаписей);
			Иначе
				ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			
			ОтменитьТранзакцию();
			Если ПричинаИсключения = "ПлохиеДанные" Тогда
				ОбновлениеИнформационнойБазыУТ.СообщитьОНеудачнойОбработке(ИнформацияОбОшибке(), ОбновляемыйРегистратор);
				Если ЗначениеЗаполнено(ОбновляемыйРегистратор) Тогда
					ОбновлениеИнформационнойБазы.ОтметитьВыполнениеОбработки(НаборЗаписей);
					ОбновлениеИнформационнойБазы.ЗарегистрироватьПроблемуСДанными(
						ОбновляемыйРегистратор,
						РегистрыНакопления.РасчетыСКлиентами.ТекстСообщенияОбОшибке(ИнформацияОбОшибке(), ОбновляемыйРегистратор)
						+ Символы.ПС + РегистрыНакопления.РасчетыСКлиентами.ТекстПерепроведитеДокументВРучную());
				КонецЕсли;
			КонецЕсли;
			
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
